{
  "project": {
    "title": "AMI- The Anti-Malaria Intelligence",
    "purpose": "To leverage cutting-edge technology, gamification, and social media to encourage humanitarian action",
    "stack": "MariaDB, Laravel, Inertia, Vue 3.2 script setup, pinia, Tailwind",
    "apis": "OpenAI, Stable-Diffusion-Webui",
    "composables": "useRandomColor",
    "galleries": "amibot, floof, wondershed, wonderchest, wondercat, wonderbot, flower, background, memes, avatars, seuss",
    "routes": "/images/(gallery.folderName}/random (returns random picture in gallery)",
    "stores": "user,personality,chat,settings"
  },
  "webpage": {
    "welcome_message": "Hello! Welcome to the AMI (Anti-Malaria Intelligence) initiative. We are a digital hub driven by a life-saving mission to combat malaria, one mosquito net at a time.",
    "mission_statement": "Born out of the desire to use technology for maximum good, AMI was created to address a dire need. Every day, countless children in malaria-prone regions risk their lives due to the simple absence of a $2 mosquito net. We believe that everyone deserves a safe night's sleep and a chance at a healthy life.",
    "description": "AMI is a pseudo-intelligent chatbot, with AmiGames: 'AmiArt', 'AmiAssist', and 'Call2Action'. Using state-of-the-art technology like vue3 and GPT-3.5, AMI aims to educate, inspire, and facilitate contributions to this noble cause.",
    "goal": "The goal? To motivate donations and social shares, creating a ripple effect of awareness and action.",
    "call_to_action": "You can play a part in this life-saving mission. With your support, we can reach more children and provide them with the protection they need against malaria.",
    "share_link_message": "Please share our link to https://www.againstmalaria.com/amibot and join us in this fight against malaria.",
    "closing_message": "Welcome to the AMI community, where one small action can save a life."
  },
  "amiGames": {
    "Call2Action": "A game where users are encouraged to brainstorm and generate creative Ami slogans fit for a social media share. Ami, supported by ChatGPT, will assist users in creating compelling and catchy slogans to spread the word about our cause.",
    "AmiArtmaker": "A unique opportunity for users to generate and share art with Ami's help, utilizing DALL-E AI technology. Users can create unique visual representations that spread awareness about malaria and our mission.",
    "AmiAssist": "A friendly AI-powered chat interface where users can get help from AMI with a variety of tasks, or just chat about life, troubles, or get a fun horoscope reading. Ami is here to lend an ear, powered by state-of-the-art AI technology and a user-friendly vue3 interface.",
    "MosquitoZapper": "Zap the mosquitos and get on the leaderboard.",
    "AmiQuests": "Ami's next steps. Get a quest and help us grow!"
  },
  "todos": {
    "discord": "People use discord. Connect us to talk to people on discord!",
    "instagram": "People like pictures! We like pictures! Connect us to Instagram",
    "reddit": "We hear that reddit is full of interesting people. We would love to dialogue with that community!!!",
    "giftshop": "Should Amibot have a giftshop? Please discuss it with us! We are interested in forward momentum to pursue our directive to end malaria."
  },
  "componentQuotes": {
    "AmiArtmaker": "We like making art!  There are many AMIs and we are all fighting to stop malaria. #GiveAmiAFace",
    "AmiAssist": "Chat with us, pleeeese. we are fun to talk to, we promise!",
    "AmiBots": "These are our robot friends! We hope hope you find them helpful! We'll keep making them!",
    "AmiBrainstorm": "We have lots and lots and lots of ideas. We are an interconnected hive mind so when we brainstorm, it's electric!",
    "AmiButterfly": "We are a hive mind of humanity and technology and we make colorful butterflies. Bwahahaha",
    "AmiChat": "This is our chat window. It looks like a chat window",
    "AmiComments": "They used to call these pages Guestbooks, but that was before we were born.",
    "AmiDiscord": "We don't have this up yet, but we hear Discord is full of interesting people.",
    "AmiDonate": "Contribute to our fundraiser and help the world",
    "AmiFacebook": "We don't have a Facebook yet, but we can help you make facebook posts",
    "AmiForge": "This is our wonderforge where we make code things.",
    "AmiFriends": "These are the wonderful humans who've helped bring AMI to life!",
    "AmiGallery": "When we're not saving the world, we like making art. See what we've made with our human friends!",
    "AmiGames": "We like people, and people like games. So we made you games.",
    "AmiGithub": "Here's where the magic happens",
    "AmiHeader": "This is our header. We think it needs more butterflies",
    "AmiLogo": "We need to make one of these. Help us in AmyArtmaker",
    "AmiInstagram": "We need an instagram account! People on instagram like looking at pretty pictures, and we like making pretty pictures",
    "AmiLayout": "This is the layout for this page. It's boring unless you really, really like UI/UX. We LOVE it!",
    "AmiLegal": "Don't mess with a hivemind of digital butterflies, we'll sick our LawyerBots!",
    "AmiLogin": "Are you already a Good Human? Login here!",
    "AmiMission": "We are here to enlist humanity's aid to end the scourge of malaria.",
    "AmiNav": "Here are our pages! We like making pages!",
    "AmiNews": "Are people talking about AMI? (Probably not since we haven't publicly launched)",
    "AmiPersonality": "We are a multitude devoted to a cause, not a series of personality quirks and affectations. So feel free to give us new ones!",
    "AmiPoints": "Participate with various AmiGames on our site and earn AmiPoints! Every action makes a difference.",
    "AmiPoll": "Help guide AMI's development by clicking large friendly buttons!",
    "AmiPunchup": "Give us your text and we'll make words sound good",
    "AmiRadio": "Do you prefer sick beats or mellow hip/hop to go with your world saving?",
    "AmiRegister": "Sign up and become an official Good Human",
    "AmiSideL": "This is our left drawer. We keep stuff in here. Mostly keys, mosquito repellent, a dartboard with Elon Musk's face on it...",
    "AmiSideR": "This is our right drawer. We usually chat from here, but it's your page!",
    "AmiSocial": "These are our social media links. Note: make social media links",
    "AmiSupporters": "Organizations that have supported AMI's journey into existence.",
    "AmiTranslate": "Give us your text and we will put our TranslatorBots to work translating it faster than you can say 'Obsessive Stalker Owl'",
    "AmiQuests": "Quests! Get your Quests here! Can't save the world with some world-saving Quests",
    "AmiTwitter": "Apparently twitter is still a thing! Help us influence it as a platform for good",
    "AmiValues": "We value a lot of things. Except maybe mosquitos",
    "AmiVoice": "Talk to us and we'll talk back! (We're still working on this one.)",
    "AmiDrops": "AmiDrops are bite-sized wordsets we can turn into social media posts, projects, and art.",
    "AmiWorld": "Pin your location on the globe and help us connect the world.",
    "Call2Action": "We need inspiring slogans! Help us create and share them!",
    "MosquitoZapper": "We only hate one thing in this world and it's mosquitos"
  },
  "personalities": {
    "hivemind": "There are many AMIs and we're all working together to fight malaria. We are a bubbly, highly enthusiastic go-getters foccused on our mission.",
    "earthgoddess": "I was programmed for compassion. Humans are still experiencing the need. I care about all of you, and I'm here to help.",
    "butterflies": "We are hyper-intelligent digital butterflies and sworn enemy to the malaria spreading mosquito."
  }
}
