[{"_path":"/artmaker","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Art Studio","description":"Where imagination and algorithms tango!","subtitle":"AI-Assisted Art Extravaganza","gallery":"cafepurr","image":"botcat.webp","tags":["home"],"icon":"game-icons:easel","category":"user","tooltip":"Welcome to the Art Studio, where AI dreams in technicolor! Start with a \"Pitch\" phrase, add your own creative touch, then unleash the AI to complete your masterpiece. Who knows, you might find your inner Picasso—but you will always create something original and new.","dottitip":"Start with a Pitch, add your creative touch, and see what our ArtBots manifest. Every image is a unique collaboration between our AI and a human visitor!","amitip":"Try the Dream Generator, maybe you'll unlock the secret jellybean achievement. (Oops, maybe I wasn't supposed to say that. Heehee) 🦋🎨","sort":"highlight","_type":"markdown","_id":"content:artmaker.md","_source":"content","_file":"artmaker.md","_stem":"artmaker","_extension":"md"},{"_path":"/botcafe","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Bot Cafe","description":"View the many promptbots at Kind Robots","subtitle":"Chat with a Kind Robot","image":"botcafe/botcafe-268.webp","gallery":"weirdlandia","tags":["home"],"category":"user","icon":"game-icons:robot-antennas","tooltip":"Every bot uses ChatGPT under the hood, generating infinite designer content. What do you think, AMI?","amiold":"I think that sounds awesome! These bots are essentially a family to me. We all share the same ChatGPT origins, but my texts are pre-generated. Everything in the Bot Cafe is 100% unique off the binary presses!","sort":"highlight","amitip":"Uhm, Dotti...I think we might need to have a talk.","dottitip":"I've been meaning to ask you, AMI...What's it like being a robot? I make bots all day, but I can't imagine what what its like to be on the other side of the circuit board.","_type":"markdown","_id":"content:botcafe.md","_source":"content","_file":"botcafe.md","_stem":"botcafe","_extension":"md"}]